src/main/resources/request-add-example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://example.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:addUserRequest>
            <us:name>Fernando</us:name>
            <us:salary>10000</us:salary>
        </us:addUserRequest>
    </soapenv:Body>
</soapenv:Envelope>